[Extraire sur plusieurs sources Excel par formule Python](https://www.youtube.com/watch?v=EB6WiQq-5KE&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=21)

Date : 29/05/2025

In [2]:
import pandas as pd

Chargement des tables

In [3]:
tb1 = pd.read_excel('data/Loc2.xlsx', sheet_name='Citroen')
tb1.head()

     Immat.   Marque Modèle
0  2677XT74  CITROEN     C3
1   AC454BD  CITROEN     C4
2   AJ007PV  CITROEN     C4
3   BB978MC  CITROEN     C5
4   BQ561JM  CITROEN   NEMO

In [4]:
tb2 = pd.read_excel('data/Loc2.xlsx', sheet_name='Peugeot')
tb2.head()

     Immat.   Marque  Modèle
0   2020JNY  PEUGEOT     208
1   2043JNY  PEUGEOT     308
2   2069JNY  PEUGEOT     308
3  5495ZQ74  PEUGEOT     206
4   8033JPB  PEUGEOT     308

In [5]:
tb3 = pd.read_excel('data/Loc2.xlsx', sheet_name='Renault')
tb3.head()

     Immat.   Marque  Modèle
0  112CSB59  RENAULT   MODUS
1  1702WK74  RENAULT  TWINGO
2   92BLK57  RENAULT  TWINGO
3   AB479LG  RENAULT  ESPACE
4   AJ969LZ  RENAULT    CLIO

Assemblage des tables ci-avant

In [6]:
tbc = pd.concat([tb1, tb2, tb2]).reset_index(drop=True)
tbc.head()

     Immat.   Marque Modèle
0  2677XT74  CITROEN     C3
1   AC454BD  CITROEN     C4
2   AJ007PV  CITROEN     C4
3   BB978MC  CITROEN     C5
4   BQ561JM  CITROEN   NEMO

Liste des plaques d'immatriculation

In [8]:
my_list = ['2677XT74', 'AC454BD', 'AJ007PV', 'BB978MC', 'BQ561JM', 'CE216DS',
           'CS727JH', 'CS878MP', '2020JNY', '2043JNY', '2069JNY', '5495ZQ74']

Conversion de la liste ci-avant en DF pandas

In [11]:
cr = pd.DataFrame(my_list).reset_index(drop=True)
cr.head()

          0
0  2677XT74
1   AC454BD
2   AJ007PV
3   BB978MC
4   BQ561JM

Recoupement des données des véhicules avec une plaque d'immatriculation sélectionnée

In [17]:
tbc.loc[tbc['Immat.']=='2677XT74'].reset_index(drop=True)

     Immat.   Marque Modèle
0  2677XT74  CITROEN     C3